### Reading Data From Different Sources

In [4]:
import pandas as pd
from io import StringIO
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'
df=pd.read_json(StringIO(Data))

In [5]:
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [6]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [7]:
df.to_json(orient='index')

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [8]:
df.to_json(orient='records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [9]:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)

In [10]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [11]:
df.to_csv("wine.csv")

In [13]:
!pip install lxml

Collecting lxml
  Downloading lxml-5.2.2-cp312-cp312-win_amd64.whl.metadata (3.5 kB)
Downloading lxml-5.2.2-cp312-cp312-win_amd64.whl (3.8 MB)
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
   ---------------------------------------- 0.0/3.8 MB 660.6 kB/s eta 0:00:06
   ---------------------------------------- 0.0/3.8 MB 660.6 kB/s eta 0:00:06
   ---------------------------------------- 0.0/3.8 MB 660.6 kB/s eta 0:00:06
   - -------------------------------------- 0.2/3.8 MB 756.6 kB/s eta 0:00:05
   ---- ----------------------------------- 0.4/3.8 MB 1.8 MB/s eta 0:00:02
   -------- ------------------------------- 0.8/3.8 MB 2.8 MB/s eta 0:00:02
   -------------- ------------------------- 1.3/3.8 MB 3.9 MB/s eta 0:00:01
   --------------- ------------------------ 1.4/3.8 MB 4.1 MB/s eta 0:00:01
   --------------- ------------------------ 1.4/3.8 MB 4.1 MB/s eta 0:00:01
   ---------------- ----------------------- 1.5/3.8 MB 3.3 MB/s eta 0:00:01
   ------------------ --------------------- 1.8/3.8 MB 3.3 MB/s eta 0:00:01
   ---------------------- ----------------- 2.1/3.8 MB 3.6 MB/s eta 0:00:01
   -------------------------- ------------- 2.5/3.8 MB 4.0 MB/s eta 0:00:01
   ---------------------------- ----------- 2.7/3.8 MB 4.2 MB/s eta 0:00:01
   ---------------------------- ----------- 2.7/3.8 MB 4.2 MB/s eta 0:00:01
   ---------------------------- ----------- 2.7/3.8 MB 4.2 MB/s eta 0:00:01
   ------------------------------ --------- 2.9/3.8 MB 3.5 MB/s eta 0:00:01
   --------------------------------- ------ 3.2/3.8 MB 3.7 MB/s eta 0:00:01
   ------------------------------------ --- 3.5/3.8 MB 3.9 MB/s eta 0:00:01
   ---------------------------------------  3.8/3.8 MB 4.1 MB/s eta 0:00:01
   ---------------------------------------- 3.8/3.8 MB 4.0 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-5.2.2

In [17]:
!pip install html5lib
!pip install beautifulsoup4

Requirement already satisfied: html5lib in e:\udemy final\python\venv\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in e:\udemy final\python\venv\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in e:\udemy final\python\venv\lib\site-packages (from html5lib) (0.5.1)
Collecting beautifulsoup4
  Using cached beautifulsoup4-4.12.3-py3-none-any.whl.metadata (3.8 kB)
Collecting soupsieve>1.2 (from beautifulsoup4)
  Using cached soupsieve-2.5-py3-none-any.whl.metadata (4.7 kB)
Using cached beautifulsoup4-4.12.3-py3-none-any.whl (147 kB)
Using cached soupsieve-2.5-py3-none-any.whl (36 kB)
Installing collected packages: soupsieve, beautifulsoup4
Successfully installed beautifulsoup4-4.12.3 soupsieve-2.5

In [19]:
url="https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"

df=pd.read_html(url)

In [21]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
...,...,...,...,...,...,...,...
564,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
565,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
566,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
567,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
568,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [23]:
url="https://en.wikipedia.org/wiki/Mobile_country_code"
pd.read_html(url,match="Country",header=0)[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [25]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.4-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.4-py2.py3-none-any.whl (251 kB)
   ---------------------------------------- 0.0/251.4 kB ? eta -:--:--
   - -------------------------------------- 10.2/251.4 kB ? eta -:--:--
   ---- ---------------------------------- 30.7/251.4 kB 660.6 kB/s eta 0:00:01
   ---- ---------------------------------- 30.7/251.4 kB 660.6 kB/s eta 0:00:01
   ---- ---------------------------------- 30.7/251.4 kB 660.6 kB/s eta 0:00:01
   --------------------------- ---------- 184.3/251.4 kB 857.5 kB/s eta 0:00:01
   ---------------------------------------- 251.4/251.4 kB 1.1 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.4

In [27]:
df_excel=pd.read_excel('data.xlsx')

In [28]:
df_excel.to_pickle('df_excel')

In [29]:
pd.read_pickle('df_excel')

    Name  Age
0  Krish   32
1   Jack   34
2   John   31